
	<div class="box">
		<div class="t">设计宗旨：大道至简</div>
		<p>繁华的世界，由简单的道理支撑。</p>
		<p>精彩的程序，由简单的规则驱动。</p>
		<p>BaiPHP-简单PHP，化繁为简，还本溯源。</p>
		<div class="t">设计模式：服务-流程-工场模式</div>
		<p>程序设计，总是希望把善变与不变分开，同时又要方便做出改变。</p>
		<p>不管呈现出什么样的面孔，程序的基本功能往往很少改变，改变的是组织与访问它们的方式，改变的是程序的【流程】。</p>
		<a class="row" href="/design/">详细内容</a>
	</div>
	<div class="box">
		<div class="t">主要特点</div>
		<ul>
			<li>简单：
				<p>没有庞大的文件结构，没有复杂的类属关系，没有夸张的函数列表，一切简简单单，明明白白，程序的本质就是化繁为简嘛。</p>
			</li>
			<li>易用：
				<p>几乎不需要学习，只要你会使用PHP和OOP，因为，我们只有7个核心类、6个系统函数和2个配置文件，而且，大部分情况下，你只需要使用1个方法。</p>
			</li>
			<li>灵活：
				<p>我们拥有你想象不到的智慧：你只需要把网页简单的放进去，它就会正确的呈现出来；你只需要配置一条验证规则，它就会自动完成从客户端到服务器的验证；你只需要把SQL语句写进文件里，它就会恰当的去执行。</p>
			</li>
		</ul>
	</div>
	<div class="box">
		<div class="t">案例学习</div>
		<p>案例1：只有两条echo语句。</p>
		<p>案例2：一个完整的HTML页面。</p>
		<p>案例3：输入项目自动验证。</p>
		<p>案例4：简单的数据库访问。</p>
		<a class="row" href="/sample/">详细内容</a>
	</div>
	<div class="box">
		<div class="t">参考资料</div>
		<p>文件结构</p>
		<p>核心类说明</p>
		<p>系统函数列表</p>
		<a class="row" href="/reference/">详细内容</a>
	</div>
